IdeaRS.Connections
CreateSegmentCommandData.PlacementDefinition Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the type of the input for placement of the segment. If value equals to DirectionVector the values of DirVectX, DirVectY, DirVectZ are expected If value equals to SphericalCoordinates,
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PlacementDefinitionType PlacementDefinition { get; set; }
Property Value
Type: PlacementDefinitionType
See Also
Reference
CreateSegmentCommandData Class
IdeaRS.Connections.Data Namespace